HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxScu_bf.h
/** \brief Mask for Ifx_SCU_CCUCON3_Bits.PLL0MONTST */
#define IFX_SCU_CCUCON3_PLL0MONTST_MSK (0x1u)

/** \brief Offset for Ifx_SCU_CCUCON3_Bits.PLL0MONTST */
#define IFX_SCU_CCUCON3_PLL0MONTST_OFF (8u)

/** \brief Length for Ifx_SCU_CCUCON3_Bits.PLL1MONTST */
#define IFX_SCU_CCUCON3_PLL1MONTST_LEN (1u)

/** \brief Mask for Ifx_SCU_CCUCON3_Bits.PLL1MONTST */
#define IFX_SCU_CCUCON3_PLL1MONTST_MSK (0x1u)

/** \brief Offset for Ifx_SCU_CCUCON3_Bits.PLL1MONTST */
#define IFX_SCU_CCUCON3_PLL1MONTST_OFF (9u)

/** \brief Length for Ifx_SCU_CCUCON3_Bits.PLL2MONTST */
#define IFX_SCU_CCUCON3_PLL2MONTST_LEN (1u)

/** \brief Mask for Ifx_SCU_CCUCON3_Bits.PLL2MONTST */
#define IFX_SCU_CCUCON3_PLL2MONTST_MSK (0x1u)

/** \brief Offset for Ifx_SCU_CCUCON3_Bits.PLL2MONTST */
#define IFX_SCU_CCUCON3_PLL2MONTST_OFF (10u)

/** \brief Length for Ifx_SCU_CCUCON3_Bits.SPBMONTST */
#define IFX_SCU_CCUCON3_SPBMONTST_LEN (1u)

/** \brief Mask for Ifx_SCU_CCUCON3_Bits.SPBMONTST */
#define IFX_SCU_CCUCON3_SPBMONTST_MSK (0x1u)

/** \brief Offset for Ifx_SCU_CCUCON3_Bits.SPBMONTST */
#define IFX_SCU_CCUCON3_SPBMONTST_OFF (11u)

/** \brief Length for Ifx_SCU_CCUCON3_Bits.BACKMONTST */
#define IFX_SCU_CCUCON3_BACKMONTST_LEN (1u)

/** \brief Mask for Ifx_SCU_CCUCON3_Bits.BACKMONTST */
#define IFX_SCU_CCUCON3_BACKMONTST_MSK (0x1u)

/** \brief Offset for Ifx_SCU_CCUCON3_Bits.BACKMONTST */
#define IFX_SCU_CCUCON3_BACKMONTST_OFF (12u)

/** \brief Length for Ifx_SCU_CCUCON3_Bits.UP */
#define IFX_SCU_CCUCON3_UP_LEN (1u)

/** \brief Mask for Ifx_SCU_CCUCON3_Bits.UP */
#define IFX_SCU_CCUCON3_UP_MSK (0x1u)

/** \brief Offset for Ifx_SCU_CCUCON3_Bits.UP */
#define IFX_SCU_CCUCON3_UP_OFF (30u)

/** \brief Length for Ifx_SCU_CCUCON3_Bits.LCK */
#define IFX_SCU_CCUCON3_LCK_LEN (1u)

/** \brief Mask for Ifx_SCU_CCUCON3_Bits.LCK */
#define IFX_SCU_CCUCON3_LCK_MSK (0x1u)

/** \brief Offset for Ifx_SCU_CCUCON3_Bits.LCK */
#define IFX_SCU_CCUCON3_LCK_OFF (31u)

/** \brief Length for Ifx_SCU_CCUCON4_Bits.LOTHR */
#define IFX_SCU_CCUCON4_LOTHR_LEN (12u)

/** \brief Mask for Ifx_SCU_CCUCON4_Bits.LOTHR */
#define IFX_SCU_CCUCON4_LOTHR_MSK (0xfffu)

/** \brief Offset for Ifx_SCU_CCUCON4_Bits.LOTHR */
#define IFX_SCU_CCUCON4_LOTHR_OFF (0u)

/** \brief Length for Ifx_SCU_CCUCON4_Bits.UPTHR */
#define IFX_SCU_CCUCON4_UPTHR_LEN (12u)

/** \brief Mask for Ifx_SCU_CCUCON4_Bits.UPTHR */
#define IFX_SCU_CCUCON4_UPTHR_MSK (0xfffu)

/** \brief Offset for Ifx_SCU_CCUCON4_Bits.UPTHR */
#define IFX_SCU_CCUCON4_UPTHR_OFF (12u)

/** \brief Length for Ifx_SCU_CCUCON4_Bits.MONEN */
#define IFX_SCU_CCUCON4_MONEN_LEN (1u)

/** \brief Mask for Ifx_SCU_CCUCON4_Bits.MONEN */
#define IFX_SCU_CCUCON4_MONEN_MSK (0x1u)

/** \brief Offset for Ifx_SCU_CCUCON4_Bits.MONEN */
#define IFX_SCU_CCUCON4_MONEN_OFF (24u)

/** \brief Length for Ifx_SCU_CCUCON4_Bits.MONTST */
#define IFX_SCU_CCUCON4_MONTST_LEN (1u)

/** \brief Mask for Ifx_SCU_CCUCON4_Bits.MONTST */
#define IFX_SCU_CCUCON4_MONTST_MSK (0x1u)

/** \brief Offset for Ifx_SCU_CCUCON4_Bits.MONTST */
#define IFX_SCU_CCUCON4_MONTST_OFF (25u)

/** \brief Length for Ifx_SCU_CCUCON4_Bits.UP */
#define IFX_SCU_CCUCON4_UP_LEN (1u)

/** \brief Mask for Ifx_SCU_CCUCON4_Bits.UP */
#define IFX_SCU_CCUCON4_UP_MSK (0x1u)

/** \brief Offset for Ifx_SCU_CCUCON4_Bits.UP */
#define IFX_SCU_CCUCON4_UP_OFF (30u)

/** \brief Length for Ifx_SCU_CCUCON4_Bits.LCK */
#define IFX_SCU_CCUCON4_LCK_LEN (1u)

/** \brief Mask for Ifx_SCU_CCUCON4_Bits.LCK */
#define IFX_SCU_CCUCON4_LCK_MSK (0x1u)

/** \brief Offset for Ifx_SCU_CCUCON4_Bits.LCK */
#define IFX_SCU_CCUCON4_LCK_OFF (31u)

/** \brief Length for Ifx_SCU_CCUCON5_Bits.GETHDIV */
#define IFX_SCU_CCUCON5_GETHDIV_LEN (4u)

/** \brief Mask for Ifx_SCU_CCUCON5_Bits.GETHDIV */
#define IFX_SCU_CCUCON5_GETHDIV_MSK (0xfu)

/** \brief Offset for Ifx_SCU_CCUCON5_Bits.GETHDIV */
#define IFX_SCU_CCUCON5_GETHDIV_OFF (0u)

/** \brief Length for Ifx_SCU_CCUCON5_Bits.MCANHDIV */
#define IFX_SCU_CCUCON5_MCANHDIV_LEN (4u)

/** \brief Mask for Ifx_SCU_CCUCON5_Bits.MCANHDIV */
#define IFX_SCU_CCUCON5_MCANHDIV_MSK (0xfu)

/** \brief Offset for Ifx_SCU_CCUCON5_Bits.MCANHDIV */
#define IFX_SCU_CCUCON5_MCANHDIV_OFF (4u)

/** \brief Length for Ifx_SCU_CCUCON5_Bits.UP */
#define IFX_SCU_CCUCON5_UP_LEN (1u)

/** \brief Mask for Ifx_SCU_CCUCON5_Bits.UP */
#define IFX_SCU_CCUCON5_UP_MSK (0x1u)

/** \brief Offset for Ifx_SCU_CCUCON5_Bits.UP */
#define IFX_SCU_CCUCON5_UP_OFF (30u)

/** \brief Length for Ifx_SCU_CCUCON5_Bits.LCK */
#define IFX_SCU_CCUCON5_LCK_LEN (1u)

/** \brief Mask for Ifx_SCU_CCUCON5_Bits.LCK */
#define IFX_SCU_CCUCON5_LCK_MSK (0x1u)

/** \brief Offset for Ifx_SCU_CCUCON5_Bits.LCK */
#define IFX_SCU_CCUCON5_LCK_OFF (31u)

/** \brief Length for Ifx_SCU_RSTSTAT_Bits.ESR0 */
#define IFX_SCU_RSTSTAT_ESR0_LEN (1u)

/** \brief Mask for Ifx_SCU_RSTSTAT_Bits.ESR0 */
#define IFX_SCU_RSTSTAT_ESR0_MSK (0x1u)

/** \brief Offset for Ifx_SCU_RSTSTAT_Bits.ESR0 */
#define IFX_SCU_RSTSTAT_ESR0_OFF (0u)

/** \brief Length for Ifx_SCU_RSTSTAT_Bits.ESR1 */
#define IFX_SCU_RSTSTAT_ESR1_LEN (1u)

/** \brief Mask for Ifx_SCU_RSTSTAT_Bits.ESR1 */
#define IFX_SCU_RSTSTAT_ESR1_MSK (0x1u)

/** \brief Offset for Ifx_SCU_RSTSTAT_Bits.ESR1 */
#define IFX_SCU_RSTSTAT_ESR1_OFF (1u)

/** \brief Length for Ifx_SCU_RSTSTAT_Bits.SMU */
#define IFX_SCU_RSTSTAT_SMU_LEN (1u)

/** \brief Mask for Ifx_SCU_RSTSTAT_Bits.SMU */
#define IFX_SCU_RSTSTAT_SMU_MSK (0x1u)

/** \brief Offset for Ifx_SCU_RSTSTAT_Bits.SMU */
#define IFX_SCU_RSTSTAT_SMU_OFF (3u)

/** \brief Length for Ifx_SCU_RSTSTAT_Bits.SW */
#define IFX_SCU_RSTSTAT_SW_LEN (1u)

/** \brief Mask for Ifx_SCU_RSTSTAT_Bits.SW */
#define IFX_SCU_RSTSTAT_SW_MSK (0x1u)

/** \brief Offset for Ifx_SCU_RSTSTAT_Bits.SW */
#define IFX_SCU_RSTSTAT_SW_OFF (4u)

/** \brief Length for Ifx_SCU_RSTSTAT_Bits.STM0 */
#define IFX_SCU_RSTSTAT_STM0_LEN (1u)

/** \brief Mask for Ifx_SCU_RSTSTAT_Bits.STM0 */
#define IFX_SCU_RSTSTAT_STM0_MSK (0x1u)

/** \brief Offset for Ifx_SCU_RSTSTAT_Bits.STM0 */
#define IFX_SCU_RSTSTAT_STM0_OFF (5u)

