HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxScu_bf.h
/** \brief Length for Ifx_SCU_PMTRCSR3_Bits.VDROOPREQ */
#define IFX_SCU_PMTRCSR3_VDROOPREQ_LEN (2u)

/** \brief Mask for Ifx_SCU_PMTRCSR3_Bits.VDROOPREQ */
#define IFX_SCU_PMTRCSR3_VDROOPREQ_MSK (0x3u)

/** \brief Offset for Ifx_SCU_PMTRCSR3_Bits.VDROOPREQ */
#define IFX_SCU_PMTRCSR3_VDROOPREQ_OFF (0u)

/** \brief Length for Ifx_SCU_PMTRCSR3_Bits.VDTRUN */
#define IFX_SCU_PMTRCSR3_VDTRUN_LEN (2u)

/** \brief Mask for Ifx_SCU_PMTRCSR3_Bits.VDTRUN */
#define IFX_SCU_PMTRCSR3_VDTRUN_MSK (0x3u)

/** \brief Offset for Ifx_SCU_PMTRCSR3_Bits.VDTRUN */
#define IFX_SCU_PMTRCSR3_VDTRUN_OFF (4u)

/** \brief Length for Ifx_SCU_PMTRCSR3_Bits.VDTOV */
#define IFX_SCU_PMTRCSR3_VDTOV_LEN (1u)

/** \brief Mask for Ifx_SCU_PMTRCSR3_Bits.VDTOV */
#define IFX_SCU_PMTRCSR3_VDTOV_MSK (0x1u)

/** \brief Offset for Ifx_SCU_PMTRCSR3_Bits.VDTOV */
#define IFX_SCU_PMTRCSR3_VDTOV_OFF (8u)

/** \brief Length for Ifx_SCU_PMTRCSR3_Bits.VDTOVCLR */
#define IFX_SCU_PMTRCSR3_VDTOVCLR_LEN (1u)

/** \brief Mask for Ifx_SCU_PMTRCSR3_Bits.VDTOVCLR */
#define IFX_SCU_PMTRCSR3_VDTOVCLR_MSK (0x1u)

/** \brief Offset for Ifx_SCU_PMTRCSR3_Bits.VDTOVCLR */
#define IFX_SCU_PMTRCSR3_VDTOVCLR_OFF (12u)

/** \brief Length for Ifx_SCU_PMTRCSR3_Bits.VDTCNT */
#define IFX_SCU_PMTRCSR3_VDTCNT_LEN (10u)

/** \brief Mask for Ifx_SCU_PMTRCSR3_Bits.VDTCNT */
#define IFX_SCU_PMTRCSR3_VDTCNT_MSK (0x3ffu)

/** \brief Offset for Ifx_SCU_PMTRCSR3_Bits.VDTCNT */
#define IFX_SCU_PMTRCSR3_VDTCNT_OFF (16u)

/** \brief Length for Ifx_SCU_STMEM3_Bits.MEM */
#define IFX_SCU_STMEM3_MEM_LEN (32u)

/** \brief Mask for Ifx_SCU_STMEM3_Bits.MEM */
#define IFX_SCU_STMEM3_MEM_MSK (0xffffffffu)

/** \brief Offset for Ifx_SCU_STMEM3_Bits.MEM */
#define IFX_SCU_STMEM3_MEM_OFF (0u)

/** \brief Length for Ifx_SCU_STMEM4_Bits.MEM */
#define IFX_SCU_STMEM4_MEM_LEN (32u)

/** \brief Mask for Ifx_SCU_STMEM4_Bits.MEM */
#define IFX_SCU_STMEM4_MEM_MSK (0xffffffffu)

/** \brief Offset for Ifx_SCU_STMEM4_Bits.MEM */
#define IFX_SCU_STMEM4_MEM_OFF (0u)

/** \brief Length for Ifx_SCU_STMEM5_Bits.MEM */
#define IFX_SCU_STMEM5_MEM_LEN (32u)

/** \brief Mask for Ifx_SCU_STMEM5_Bits.MEM */
#define IFX_SCU_STMEM5_MEM_MSK (0xffffffffu)

/** \brief Offset for Ifx_SCU_STMEM5_Bits.MEM */
#define IFX_SCU_STMEM5_MEM_OFF (0u)

/** \brief Length for Ifx_SCU_STMEM6_Bits.MEM */
#define IFX_SCU_STMEM6_MEM_LEN (32u)

/** \brief Mask for Ifx_SCU_STMEM6_Bits.MEM */
#define IFX_SCU_STMEM6_MEM_MSK (0xffffffffu)

/** \brief Offset for Ifx_SCU_STMEM6_Bits.MEM */
#define IFX_SCU_STMEM6_MEM_OFF (0u)

/** \brief Length for Ifx_SCU_OVCENABLE_Bits.OVEN0 */
#define IFX_SCU_OVCENABLE_OVEN0_LEN (1u)

/** \brief Mask for Ifx_SCU_OVCENABLE_Bits.OVEN0 */
#define IFX_SCU_OVCENABLE_OVEN0_MSK (0x1u)

/** \brief Offset for Ifx_SCU_OVCENABLE_Bits.OVEN0 */
#define IFX_SCU_OVCENABLE_OVEN0_OFF (0u)

/** \brief Length for Ifx_SCU_OVCENABLE_Bits.OVEN1 */
#define IFX_SCU_OVCENABLE_OVEN1_LEN (1u)

/** \brief Mask for Ifx_SCU_OVCENABLE_Bits.OVEN1 */
#define IFX_SCU_OVCENABLE_OVEN1_MSK (0x1u)

/** \brief Offset for Ifx_SCU_OVCENABLE_Bits.OVEN1 */
#define IFX_SCU_OVCENABLE_OVEN1_OFF (1u)

/** \brief Length for Ifx_SCU_OVCENABLE_Bits.OVEN2 */
#define IFX_SCU_OVCENABLE_OVEN2_LEN (1u)

/** \brief Mask for Ifx_SCU_OVCENABLE_Bits.OVEN2 */
#define IFX_SCU_OVCENABLE_OVEN2_MSK (0x1u)

/** \brief Offset for Ifx_SCU_OVCENABLE_Bits.OVEN2 */
#define IFX_SCU_OVCENABLE_OVEN2_OFF (2u)

/** \brief Length for Ifx_SCU_OVCENABLE_Bits.OVEN3 */
#define IFX_SCU_OVCENABLE_OVEN3_LEN (1u)

/** \brief Mask for Ifx_SCU_OVCENABLE_Bits.OVEN3 */
#define IFX_SCU_OVCENABLE_OVEN3_MSK (0x1u)

/** \brief Offset for Ifx_SCU_OVCENABLE_Bits.OVEN3 */
#define IFX_SCU_OVCENABLE_OVEN3_OFF (3u)

/** \brief Length for Ifx_SCU_OVCCON_Bits.CSEL0 */
#define IFX_SCU_OVCCON_CSEL0_LEN (1u)

/** \brief Mask for Ifx_SCU_OVCCON_Bits.CSEL0 */
#define IFX_SCU_OVCCON_CSEL0_MSK (0x1u)

/** \brief Offset for Ifx_SCU_OVCCON_Bits.CSEL0 */
#define IFX_SCU_OVCCON_CSEL0_OFF (0u)

/** \brief Length for Ifx_SCU_OVCCON_Bits.CSEL1 */
#define IFX_SCU_OVCCON_CSEL1_LEN (1u)

/** \brief Mask for Ifx_SCU_OVCCON_Bits.CSEL1 */
#define IFX_SCU_OVCCON_CSEL1_MSK (0x1u)

/** \brief Offset for Ifx_SCU_OVCCON_Bits.CSEL1 */
#define IFX_SCU_OVCCON_CSEL1_OFF (1u)

/** \brief Length for Ifx_SCU_OVCCON_Bits.CSEL2 */
#define IFX_SCU_OVCCON_CSEL2_LEN (1u)

/** \brief Mask for Ifx_SCU_OVCCON_Bits.CSEL2 */
#define IFX_SCU_OVCCON_CSEL2_MSK (0x1u)

/** \brief Offset for Ifx_SCU_OVCCON_Bits.CSEL2 */
#define IFX_SCU_OVCCON_CSEL2_OFF (2u)

/** \brief Length for Ifx_SCU_OVCCON_Bits.CSEL3 */
#define IFX_SCU_OVCCON_CSEL3_LEN (1u)

/** \brief Mask for Ifx_SCU_OVCCON_Bits.CSEL3 */
#define IFX_SCU_OVCCON_CSEL3_MSK (0x1u)

/** \brief Offset for Ifx_SCU_OVCCON_Bits.CSEL3 */
#define IFX_SCU_OVCCON_CSEL3_OFF (3u)

/** \brief Length for Ifx_SCU_OVCCON_Bits.OVSTRT */
#define IFX_SCU_OVCCON_OVSTRT_LEN (1u)

/** \brief Mask for Ifx_SCU_OVCCON_Bits.OVSTRT */
#define IFX_SCU_OVCCON_OVSTRT_MSK (0x1u)

/** \brief Offset for Ifx_SCU_OVCCON_Bits.OVSTRT */
#define IFX_SCU_OVCCON_OVSTRT_OFF (16u)

/** \brief Length for Ifx_SCU_OVCCON_Bits.OVSTP */
#define IFX_SCU_OVCCON_OVSTP_LEN (1u)

/** \brief Mask for Ifx_SCU_OVCCON_Bits.OVSTP */
#define IFX_SCU_OVCCON_OVSTP_MSK (0x1u)

/** \brief Offset for Ifx_SCU_OVCCON_Bits.OVSTP */
#define IFX_SCU_OVCCON_OVSTP_OFF (17u)

/** \brief Length for Ifx_SCU_OVCCON_Bits.DCINVAL */
#define IFX_SCU_OVCCON_DCINVAL_LEN (1u)

/** \brief Mask for Ifx_SCU_OVCCON_Bits.DCINVAL */
#define IFX_SCU_OVCCON_DCINVAL_MSK (0x1u)

/** \brief Offset for Ifx_SCU_OVCCON_Bits.DCINVAL */
#define IFX_SCU_OVCCON_DCINVAL_OFF (18u)

/** \brief Length for Ifx_SCU_OVCCON_Bits.OVCONF */
#define IFX_SCU_OVCCON_OVCONF_LEN (1u)

/** \brief Mask for Ifx_SCU_OVCCON_Bits.OVCONF */
#define IFX_SCU_OVCCON_OVCONF_MSK (0x1u)

/** \brief Offset for Ifx_SCU_OVCCON_Bits.OVCONF */
#define IFX_SCU_OVCCON_OVCONF_OFF (24u)

/** \brief Length for Ifx_SCU_OVCCON_Bits.POVCONF */
#define IFX_SCU_OVCCON_POVCONF_LEN (1u)

/** \brief Mask for Ifx_SCU_OVCCON_Bits.POVCONF */
#define IFX_SCU_OVCCON_POVCONF_MSK (0x1u)

